[
    {
        "index": 1,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/footballmaniac/yet-again-football-loses-a-celebrated-player-54811/",
        "title": "Yet again Football loses a celebrated player",
        "content": "With 570 career goals, nine club transfers and countless savage moments in football, Zlatan Ibrahimovi has retired from football at the age of 41 years. His journey from Malm FF to AC Milan has been one of the greatest. Scoring over 500 club goals, he has been giving pleasure to millions of football fans across the globe for more than two decades. His goals have been mind blowing! The strategy, the movement and the execution is unimaginable. Widely known for his bicycle goals, the karate kicking goals and his dribbling skills, he is literally one of the worlds finest players. Well known for his savage comments and comebacks in football, Zlatan never fails to disappoint the media. One such incident was when Cristiano Ronaldo scored a beautiful bicycle kick from Real Madrid against Juventus in 2018 Champions League. Referring to this goal, one interviewer asked Zlatan, Cristiano Ronaldo scored today, how would you describe that? And who is a better goal scorer, you (Zlatan) or Ronaldo? Zlatan replied with, He (Cr7) scored a beautiful goal today but he should try it from 40 meters. The interviewer roared with laughter and this caught attention of the fans and media pretty quick. Zlatan was referring to his bicycle kick goal against England which he scored from 40m. A sensational goal it was, contributing to his memorable career. Zlatans amazing goal from Ajax against NAC football club has gone down in history books. He dribbled past 5 opponent players and the goal keeper, leaving them all confused. And the list of goals and assists go on and on. Once in an interview, he was asked which superpower would he like to possess and he replied, I already have them. Media, yet again got a Classic Zlatan answer. The 41 year old had shared a great bond with Lionel Messi, having played with him in Barcelona during 2009-11. Zlatan was always ready to stand up for his Argentinian friend, preferring him in award shows and interviews. Zlatan was given a grand farewell by AC Milan. The striker announced to AC Milan fans that he will he will retire after they played their final game of the season against Hellas Verona on Sunday. Ibrahimovic was in tears in front of the San Siro crowd as he bid farewell to the club and called time on his glittering career. He has been one of the most magnificent player of this football era. The little kids who had just started being fond of football because of him to the old ones who enjoyed seeing him play, shed tears during Zlatans retirement speech. This retirement was enough to make an old man cry. Zlatan retiring from football is an end of a powerful era. Having contributed so much to football, all fans gave him a big thanks. He has surely blessed our eyes by his career. However, during his speech, he was interrupted by loud booing by the fans of Verona. Zlatan fired back the perfect response saying, Keep booing. This is the biggest moment in your year seeing me. Its only true that, Lions, they dont compare themselves with humans.- Zlatan Ibrahimovic",
        "words_count": 525,
        "datetime": "2024-04-27 21:38:02"
    },
    {
        "index": 2,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/legalperspectives/unending-saga-of-smashing-racquets-54954/",
        "title": "Unending saga of smashing racquets",
        "content": "Tennis is usually considered the gentlemans sport and of course why not? It is indeed an individual sport requiring great strength and endurance. But certain acts dont do justice to such labels. Tennis players are seen smashing their racquets in a fit of rage. Considering the other side of the coin it might not seem all wrong as there is immense pressure players are in and sometimes such rage acts make them cool down but should this be supported or appreciated? Smashing racquets is legally prohibited by the rules of tennis and is considered very unsportsmanlike having huge penalties and fines associated with it. A large number of players chose this violation each year. The racquet abuse rule includes intentionally and violently destroying rackets, and equipment or hitting the net and umpires chair. This can attract fines ranging from $500  $2500 per violation and many times even a point penalty, game penalty, or getting defaulted in extreme cases. It is a violation of the code of conduct, there is a risk of injury, damage, and negative impact on the game and everyone. Maybe the players can afford to lose racquets in such a way, but this should not be promoted. Videos can be easily found in YouTube titles such as Most epic racquet smashes. The dilemma is, what is epic in this? In cricket, when it rains, the cricketers try to protect their bat first before themselves, in many cultures whenever a foundation is laid for a building the equipment is first worshipped, even in wars the weapons were worshipped before going into the battlefield. These are means of your livelihood and should be respected. Talking about tennis, the racquet is all the means because of which the players are playing in that position, earning money, income, feeding the family, and they have all they want because of it. Young children look up to these players aspiring to be like them one day, and such furious actions do make them frown. And it also comes as a surprise that it seems strange to see these players gaining too much success and experience, to react in this way. And by smashing the racquets they prioritize it over actually winning the game. These reactions are also welcomed with boo from the audience.  Nick Kyrios is the player who has one of the most racquets smashes and has probably paid a lot of fines as well. Novak Djokovic showed disappointing behavior by smashing racquets, screaming, hitting the net, and even throwing his racquet into the audience in the auspicious 2020 Olympics. This type of activity not only disrespects the sport, but also the racquet, the court, the audience, and the fans. The Olympics is such a big organization and people work day and night to get to represent their country in it. Djokovic displaying this behavior was embarrassing. Rafael Nadal condoned his demeanor and was thankful as there was no one sitting in the stands. Winning and losing are part and parcel of any game, especially in tennis where there are no draws. Racquet abuse is a way to promote unacceptance of loss which is not something any sport is meant for setting poor examples for others. Hence, there could be more constructive ways to manage emotions in court thereby ending the saga of smashing racquets.",
        "words_count": 554,
        "datetime": "2024-04-27 21:38:11"
    },
    {
        "index": 3,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/borntowrite/ms-dhoni-a-cricketing-psychologist-54874/",
        "title": "MS Dhoni: A cricketing psychologist",
        "content": " Mahendra Singh Dhoni is a name that resonates perfectly with cricketing excellence, unaware composure, and strategic brilliance. Looking at his cricketing stats and career, hardly any cricket lover would accept him as a pure cricketing psychologist. Dhoni was born on July 7, 1981, in Ranchi, Jharkhand, India, apart from his exceptional batting and lightning wicket-keeping skills known for his stupendous understanding of psychological aspects and factors of cricket. His recent Indian premier league season16triumph is an example of it. Even his contemporaries are beyond astute with his cricketing psychology. Cricket is more of a mental battle than a physical sport that requires resilience, decision-making, and strategic planning. In this season of IPL, MS Dhonis ability to read the game allowed him to make crucial changes in the lineup and strategies in the team and led his team towards a successful season, and instilled a sense of belief among the team members by creating a winning culture of the squad. The IPL victory brought glory to CSK and exemplified Dhonis exceptional cricketing psychology.  Synonym of the word Calmness Calmness, the most unruffled demeanor of Mahendra Singh Dhoni, even in the most difficult and intense situations he can use it as the sharpest weapon to overpower the opponents. His calm demeanor is a reflection of his cricketing psychology and philosophy. Calmness is the most intriguing strength that has enabled MS Dhoni to not just guide his team to victory on numerous occasions but also instill a winning mentality like his teammates.  Emotional intelligence and understanding of the game and players Dhoni is encompassed with sheer emotional intelligence and psychology. His understanding of each member of the squad and bringing out the best in the individual makes him a people person. He turns the emotions, and weaknesses of every player into the biggest strength. The emotional support he constantly gives to every player and the belief he shows in their abilities makes him the definition of a true leader. Many Indian to international players have said that he creates an atmosphere in camp where feels valued and feels he can do more than the ability of his own for the team. Ravindra Jadeja, Rohit Sharma, and Ishant Sharma are a few of the many examples who have been constantly backed by captain cool. Which resulted in positive impacts on Indian cricket. MS Dhoni recognizes the psychology of every player and builds a cohesive and motivated team. The helicopter shot hitters remarkable ability to decision-making is an example of his astute emotional intelligence in the game of cricket.  The adaptive approach in the game Adaption is the step of learning new and correcting the wrongs. MS Dhoni has perfectly demonstrated his adaptability skills throughout his career which played a vital role in his cricketing success. His flexible leadership quality of Dhoni is the reason why he brilliantly not just understands but adapts to numerous personalities, game situations, and playing conditions. He has the innate sense of taking risks and playing safe at the same time, His knack for making on-the-spot decisions and changing team strategies as per circumstances based on evolving dynamics of matches brought him the stature of cricketing psychology.  The champion of mind positivity Doesnt matter lifting the trophy with the winning side or standing on the losing side, what remains constant is the smile and positive spirit on the face of MS Dhoni. His unwavering positive resilience and mindset are instrumental in his cricketing success. Mahis positive approach towards challenges with an attitude of never giving up makes him an inspiration not just for his team but for every individual who follows him. The ability to chase difficult targets often leads to miraculous victories. Instead of losing his positive approach, he uses it to achieve the target by pushing back against negativity. It was MS Dhoni who instilled positivity in Ravindra Jadeja who once last season wanted to leave CSK. Now his belief made Jadeja the hero of this seasons final. His belief in comebacks against setbacks adds him to the elite group of inspiration. He has excelled in the game of mind positivity as well.  Tactical skills and execution However, cricket experts say that MS Dhonis irresistible acute tactical intelligence is characterized in a psychological manner. The tactical brilliance of Mahi can be a great case study for every aspiring cricketer. His incredible innovation in tactics and ability to keep extra plans for every possible situation, always helped him to stay ahead against the opposition. Whether manipulating the different field placements by changing their positions regularly as per the need of the game, or using the bowlers in the most unorthodox ways, he has chased impossible targets with perfection and snatched victory for the nation with his exceptional tactics. Conclusion: Dhonis legacy will be remembered as the greatest of all time in cricketing history. His influence and mind-mastering skills will inspire future generations of cricket. If ever a book is written on the history of cricket and its legendary figures, Dhonis name will be there not only in different sections like batting, Wicket keeper or captaincy but there would also be a proper section titledCricketing psychologist Mahendra Singh Dhoni. ",
        "words_count": 859,
        "datetime": "2024-04-27 21:38:26"
    },
    {
        "index": 4,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/cricket-corner/wtc-loss-to-australia-brings-back-memories-of-2003-wc-final-for-india-55107/",
        "title": "WTC loss to Australia brings back memories of 2003 WC final for India",
        "content": "Ankit Kumar Singh Australias emasculation of India in the World Test Championship (WTC) final at The Oval on Sunday felt like a dj vu of the 2003 ODI World Cup finale when the two cricketing powerhouses had last met in the final of an ICC event. Ever since the inaugural ODI World Cup was played in England 52 years ago, there have been 22 ICC tournaments so far (12 ODI World Cups, 8 ICC Champions Trophies, 2 WTCs). However, only on two occasions, India and Australia have clashed in the final with the men from Down Under emerging triumphant on both occasions. The first of these occasions materialized at the New Wanderers Stadium in Johannesburg 20 years ago when the two sides battled it out for the ODI WC crown. The recently concluded WTC final marked the second encounter between the two proud nations. There are some uncanny similarities between the two finals which took place in two different decades. On both occasions, an Indian captain won the toss and chose to field first only to see the opposition batters send his bowlers on a leather hunt. Also, a pair of Australian batters took the game away from India in each of these two games that was played at a neutral venue. In 2003 it was Sourav Ganguly who won the toss and opted to bowl first. The decision clearly backfired as Australia went on to amass a mammoth 359/2 in 50 overs on the back of a sterling hundred from Ricky Ponting (121-ball 140) and an elegant 84-ball 88 from Damien Martyn. In reply, India were bowled out for 234 to hand over the WC title to the Australians. Cut to the 2023 WTC final at The Oval and a similar script unfolded on Day One with Rohit Sharma sending Australia in after winning the spin of the coin. After India had Australia reeling at 76/3, two opposition batters  Travis Head (163, 174 balls) and Steve Smith (121, 268 balls)  turned the game on its head with a partnership of 285 runs for the fourth wicket. Riding on their magnificent tons, Australia posted a huge first-innings total of 469 which set up their 209-run decimation of India in the end. REVENGE OF THE AUSSIES For Australia, the WTC triumph also marked the end of a six-year jinx featuring their Test battles with India. Since 2017, they had lost four back-to-back Test series against India with two of these defeats coming in home conditions. One of these series included the four matches played in 2020-21 when India were skittled for 36 in the second innings of the first Test in Adelaide before making a comeback for the ages to trample the hosts in Melbourne, pull off a draw in Sydney and then breach the seemingly impregnable Gabba despite missing the services of several key players to register a historic 2-1 win. India were also the only team to have beaten Australia in the current WTC cycle that began in 2021. Out of the six series they played during this period, they won five of them including victories over England (4-0), South Africa (2-0) and the West Indies (2-0) at home, and a memorable 1-0 win in Pakistan. In Sri Lanka, they had to share the spoils 1-1 while in India, they suffered a 2-1 defeat. In the WTC final, though, Australia were the better side of the two by miles. They outshone India with both bat and ball to take home their 9th ICC silverware, a record no other country is even close to emulating. India and the West Indies (five each) are jointly second on the list of teams with most number of ICC trophies. Advance Australia Fair.",
        "words_count": 621,
        "datetime": "2024-04-27 21:38:30"
    },
    {
        "index": 5,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/theintersection/the-journey-of-indian-football-achievements-decline-and-the-path-to-powerhouse-status-54826/",
        "title": "The journey of Indian football: Achievements, decline and the path to powerhouse status",
        "content": "Football, often hailed as the worlds most popular sport, has had a fascinating journey in India. While the nation boasts a rich sporting heritage, the sport of football has faced its fair share of challenges. This blog post delves into the history of Indian football, its notable achievements, its subsequent decline, and the factors that have prevented India from emerging as a powerhouse in the global football arena. A glorious past: The roots of football in India can be traced back to the mid-19th century, during British colonial rule. The sport gained popularity among the Indian elite and gradually spread across the country. Indias first official football club, Mohun Bagan Athletic Club, was founded in 1889 in Kolkata, marking the beginning of a vibrant football culture. One of the most remarkable achievements in Indian football history occurred in 1951 when the Indian national team triumphed at the Asian Games in New Delhi, defeating heavyweights like Iran and Indonesia on their path to glory. This success put Indian football on the global map and raised hopes of a bright future for the sport in the nation. The decline: However, despite promising beginnings, Indian football faced a period of decline in subsequent decades. Several factors contributed to this decline, including the lack of infrastructure, poor grassroots development, inadequate coaching programs, limited exposure to international competitions, and a focus on other sports like cricket. As a result, Indian football struggled to maintain its early momentum and fell behind other nations on the global stage. Challenges hindering Indias emergence as a powerhouse: Infrastructure and facilities: One of the key challenges faced by Indian football is the scarcity of quality infrastructure and training facilities. The availability of well-maintained stadiums, training centers, and academies is crucial for nurturing young talent and ensuring their proper development. Grassroots development: The foundation of any successful footballing nation lies in its grassroots development programs. In India, the emphasis on grassroots football has been relatively limited, resulting in a shortage of talent identification and nurturing systems at the grassroots level. Coaching and technical expertise: The development of skilled coaches and technical expertise is vital for the growth of football in any country. India has witnessed a shortage of well-qualified coaches who can effectively impart their knowledge and experience to young players. Competition structure: The structure of domestic competitions plays a significant role in shaping the quality of football. In India, the domestic league system has experienced inconsistencies and lack of long-term planning, hindering the growth of the sport at the professional level. Cultural factors: Indias passion for cricket has often overshadowed the popularity of football. The cultural dominance of cricket, coupled with limited media coverage and sponsorship opportunities for football, has hampered the sports growth and popularity among the masses. The path to powerhouse status: Despite the challenges, there are encouraging signs that Indian football is on the path to revival. The establishment of the Indian Super League (ISL) in 2014 injected new energy and investment into the sport. Additionally, efforts are being made to improve grassroots development programs, enhance coaching education, and upgrade infrastructure facilities. Furthermore, increased exposure to international football through friendlies, participation in regional tournaments, and investment in youth development are steps in the right direction. The All India Football Federation (AIFF) has also implemented strategic plans to enhance the national teams performance and increase their FIFA rankings. Indian football has a captivating history, with remarkable achievements, followed by a period of decline. However, the nations potential to emerge as a football powerhouse remains intact. Addressing the challenges of infrastructure, grassroots development, coaching expertise, competition structure, and cultural factors will be crucial in unlocking Indias footballing prowess. With sustained efforts from various stakeholders, including government bodies, football associations, clubs, and fans, India has the potential to rise to prominence in the global football landscape. The journey may be challenging, but the passion for the beautiful game and the untapped talent within the country provide hope for a bright future for Indian football.",
        "words_count": 664,
        "datetime": "2024-04-27 21:38:40"
    },
    {
        "index": 6,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/economyreweave/team-india-needs-a-magic-combination-of-youth-and-experience-55274/",
        "title": "Team India needs a magic combination of youth and experience",
        "content": "The performance of some youngsters was outstanding in the IPL 2023. Some of them can be picked up for the West Indies tour and for the ICC World Cup. Young players should get a chance in their 20s and not in their 30s. The senior and experienced players should not play for decades and leave the scene for the young talents who can instill life into the team. Team India should be a magic combination of youth and experience. Ruturaj Gaekward and Shubman Gill are straight bats with strong defense as well as aggression; they have a wide range of strokes. They can give India a good start. Both are gifted players and can do very well in the Indian condition. The duo should not hesitate to take tips from the former masters like Sunil Gavaskar, Sehwag, Yuvraj Singh, Dhoni and Sachin Tendulkar so that they could overcome their unseen flaws in their batting and temperament. It is very essential for the opening pair. Yashasvi Jaiswal can come at the first down and the next slot should go to Sai Sudharshan; both are disciplined, technically sound and they have a wide range of strokes. They are in good form and this is the right time to play these players in the team. Hit the iron when it is red hot. Virat Kohli and Ajinkya Rahane will be the pillars of the Indian batting and both should dig in and play the role of finishers. Rahane is in magical touch but he is not tough enough to carry the bat. Kohli is tough and he can do the impossible with his ability to improvise. But, Kohli has to be extra careful against the out-swingers pitching on the off stump and on outside the off stump. We cant keep Ishan Kishan waiting as the wicket keeper batsman. He can hit hard, rotate the score board and pile up runs in the middle. Hardik Pandya and Ravindra Jadeja should always be in the all rounder list. India will have a very strong middle order who can manage the tail also. Jasprit Bumrah, Shardul Thakur, Harshdeep Singh, Bhubaneswar Kumar and Mohammed Shami are good enough to manage the pace attack well; all have bites, movement and bounce. Yuzvendra Chahal and Axar Patel are the perfect choice for the spin attack. The good news is that Axar Patel, Shardul Thakur, Muhammad Shami, Bhubaneswar Kumar and Bumrah can contribute in batting. So the Indian tail looks formidable with so many pinch hitters. A few Indian top order batsmen should develop the ability to bowl so that they could be used as surprise weapons in the ICC World Cup before they are tested in the West Indies. So the fantastic team for the ICC World Cup should be Ruturaj Gaekward, Shubman Gill, Yashasvi Jaiswal, K Sudarshan, Virat Kohli, Rahane, Hardik Pandya, Ravindra Jadeja, Surya Kumar Yadav, Shardul Thakur, Harshdeep Singh, Mohammed Shami, Jasprit Bumrah, Yuzvendra Chahal and Axar Patel. All these players should be included in the West Indies tour; their potential will be tested there before the prestigious ICC World Cup. Rohit Sharma, Ravichandra Aswini, Cheteswar Pujara and Umesh Yadav should make room for the youngsters who can instill vibrancy into the team.",
        "words_count": 537,
        "datetime": "2024-04-27 21:38:44"
    },
    {
        "index": 7,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/theblogger/again-fell-short-55551/",
        "title": "Again fell short!",
        "content": "The baton has passed on successfully. We have taken the tag of modern chokers from South Africa as we again landed where we were two years ago. The crushing defeat in the 2023 WTC final has once again unleashed the weaklings India team suffer from. Again therell be contemplation over Indias loss and voices will emerge from every nook and corner to change the captain and the entire team if need be. But all will be forgotten, once the team starts its another WTC cycle after a month. The same critics will cheer for the team in the world cup scheduled later this year. In India, cricket is a religion and players are worshipped as Gods. Before every important match, videos and photos surface on the internet showing crazy fans worshipping their cricketing idols. Being an Indian cricket fan is traumatic particularly in ICC tournaments. Since weve once again fallen short of an ICC Trophy, its time that we analyse what went wrong for us and what were the domains where we could have planned meticulously. IPL is the elephant in the room Though its certain that IPL brings much needed glory to cricket, it binds Indian players to get stuck to it, thanks to the big bonanza it guarantees. This years IPL was no different. Indian players earned enormously from the IPL but at the cost of WTC preparations. Indian players didnt get much time to prepare for the final as the IPL ended on 29th May. With only a week of practice they entered into the finals and put up a forgettable show. The same was heard of in the post match conference when Indian captain complained about lack of practice and teams inability to acclimatise according to the overcast conditions. Poor team selection Before the match, it was said that UK weather is seamer friendly which means four pacers and one spinner would be the right composition for playing eleven. Keeping this in mind, the worlds number one ranked bowler was reduced to a bencher who would bring drinks to quench the thirst of those playing. R. Ashwin might have chosen another business over cricket had he had little knowledge about this. In fact he showed his willingness to be a part of playing eleven but unfortunately luck didnt favour him. This strategy of Indian think-tank fell miserably as Ashwins counterpart Nathan Lyon proved us wrong and performed exceedingly well. Absence of chief selector Ever since former chief selector Chetan Sharma has stepped down from his position, SS Das is the acting chief. It is unimaginable for a team who has great records in the past matches to enter into the final of an ICC event without a fully functional selection committee. Now as fingers are being raised at the committee, BCCI in hurry is showing some signs of tackling the issues by hurriedly filling up all the vacant positions. It would not be wrong to say that Indian politics more or less has taken a toll on BCCI as well as bigwigs here often seem to be influenced by it. Dismal performance by top batters Indian batters are known for their perseverance and grit. There have been several occasions when they have won innumerable matches for us. But this time when all eyes were glued to the TV screen, our batters could not live up to their fans expectations. Our batting order fell like a peck of cards with only a few scores of fifty or plus. If one looks at the past batting records of the Indian batters in tests, it would become clear that our batters are suffering from century drought. All Indian batters collectively have not scored as many centuries as English batter Joe Root has scored in the past two years. This shows the striking difference between batters of both the countries. Majority of top Indian batters are in their 30s with retirement looming over them. Its time that selectors pay close heed and begin grooming young talents so that they can get ready for national duty. Shorter version of cricket has higher emotional investment in India We, as cricket fans, have to blame ourselves too because we dont put much effort when it comes to cheering for test cricket. Whenever India loses any white ball ICC tournaments, critics start going down hard on Indian players with sting in their voices. The same goes missing in red ball ICC tournaments. Here there is a hue but not so sharp as one which we as a critic produce for the former one. The pop culture puts all its focus on the white ball cricket feats rather than putting up less attention to the historical test match winstoo gives less attention to the historical test match wins. Barely an average Indian cricket fan may be knowing about any of the historical moments associated with test cricket as he in all likelihood finds it tedious to follow the red ball cricket. It would be okay for us if we say that India is not among the favourites to win this years ICC mens world cup, though it will be played in India. When team India will start its outing in yet another ICC tournament, it will be laden with hopes and dreams of billions of cricket fans across the globe as always has been the case who always support the team no matter what.",
        "words_count": 899,
        "datetime": "2024-04-27 21:38:47"
    },
    {
        "index": 8,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/aadityakanchanblogs/top-3-england-players-to-watch-out-in-ipl-2023-51770/",
        "title": "Top 3 England players to watch out in IPL 2023",
        "content": "This year IPL will start this time from March 31, 2023. Already a lot of bidding was done on foreign players & Indian players in the latest IPL auction. Here are the top 3 English players to watch out Ben stokes After getting redemption in the 2022 t 20 world cup , He proved everyone why he is one of the best all-rounder in the world. Stokes made his international debut for England in August 2011 in a limited-overs match against Ireland. He is known for his aggressive batting, powerful bowling, and brilliant fielding. Stokes has been involved in many memorable moments in international cricket. In the 2019 World Cup final, he scored 84 not out to help England tie the match against New Zealand, and then he batted in the Super Over to help his team win the trophy. Talking about his t 20 career in 43 matches he scored 585 runs with average of 32.83,with a single 50 which came in the t20 world cup final 2022, coming towards the ipl career in 42 matches he scored 942 runs with 2 century and 2 half century. While his career has had its ups and downs, there is no doubt that Stokes will continue to be a key player for his country and CSK in the coming future. Sam curran The young sensation Sam curran was the man of tournament in the last year 2022 t20 world cup. He is a young and exciting English cricketer who has made a name for himself in both domestic and international cricket. He made his international debut for England in 2018, and he has since become a regular member of the team in all formats of the game. Also he was sold to 18.5 crores to PBKS which is itself a IPL record for getting at the maximum price. In 36 matches international he took 42 wickets with an economy rate of 7.83 run per over. With his performances he earned respect from cricket fans around the world. With his talent definitely his ipl team will be getting some more bowling and in depth batting. Harry Brook The bright and young playing sensation Harry brook already proved himself in test cricket with the help of the bazball technique, He also played very crucial knocks in PSL & in international t 20 career as well. Brook is known for his elegant and fluent batting style with a aggressive batting approach which will be providing SRH a very good batting strength to the team. He was also the part of 2022 T20 World Cup winning team England. He also holds a record of scoring 3 consecutive hundred in 3 matches against Pak in Pak with a healthy strike rate in test cricket. Talking about his t 20 career in 20 matches he scored 382 runs with average of 26.83, with a highest score of 81* against Pak with strike rate of 137.89. But the question arises will he able to capitalise in Ipl, We will have to find in the upcoming IPL season.",
        "words_count": 509,
        "datetime": "2024-04-27 21:38:53"
    },
    {
        "index": 9,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/ayushmanpost/the-revolutionized-approach-of-women-in-sports-52363/",
        "title": "The revolutionized approach of women in sports",
        "content": "Women are the foundation of every family and of society as a whole. They are outstanding performers who significantly contribute to societys empowerment. Women are viewed as inferior to males not just in India but around the world, yet despite this, they strive to outperform them. Many Indian sportswomen have made an effort to liberate themselves from the constraints of prejudice, social exclusion, and cultural bias in order to build a successful careers for themselves. Female athletes have occupied an esteemed place in society by acquiring numerous roles other than being just a mother. They have finally received recognition as a result of their perseverance, hard work, and desire to prove themselves. Perhaps womens incredible progress is a wonderful result of their commitment and aspirations. Sports have the ability to transform lives. the capacity to promote gender equality by instilling in women and girls the values of cooperation, independence, fortitude, and self-assurance. Women who excel in athletics challenge gender conventions and prejudices, serve as positive role models, and promote equality for both sexes. Female athletes overcome all obstacles with their commitment and hard effort, despite the fact that males are more acclaimed and paid more than women. Sania Mirza, Mary Kom, Mithali Raj, PV Sindhu, Saina Nehwal, and more athletes have made the country proud with their illustrious triumphs in a variety of sports. They have moved beyond the realm of athletics that was formerly controlled by males. The number of female athletes is always growing, and they are equally unmatched and unbeatable. Despite the rise in the number of female athletes in the sports sector. One of the main issues facing Indian society is gender equality, which is currently being addressed by a number of authorities and women as well. The salary gap between women athletes and their male counterparts, which is either half or less, is the biggest obstacle facing female competitors in sports. The earnings of men and women differ greatly, and the same is true of prize money. Aside from this, female athletes are less diverse than male athletes. The prospects for female athletes consistent income and job stability are grim. Women have little choice but to take up other work in order to supplement their income. Despite these obstacles, female athletes are pushing themselves to be the best versions of themselves and are making history. Nevertheless, there are a few outstanding female athletes who are revered and who have motivated the next generation to pursue their aspirations. Sania Mirza is the first and only female Indian tennis player to have captured six major championships. She has received the Padma Shri and Arjuna Awards. Many women have been motivated by her to showcase their abilities and go after their aspirations. MC Mary Kom, who experienced gender prejudice, became the only female boxer to take home medals in every amateur boxing division. She is an Olympic boxer from India also known as the Unbreakable. She has won the world amateur boxing title five times. Moreover, she was the only female boxer to medal in any of the six world championships. Mary Kom has received several honours, including the Padma Shri, the Arjuna Award for Boxing, and the Major Dhyan Chand Khel Ratna Award. The first badminton player from India to earn an Olympic medal is Saina Nehwal. She is the first female and second Indian shuttler after Prakash Padukone to hold the top ranking in the world. She is credited with boosting badmintons appeal in India. For her accomplishments, she has received the Arjuna Award, Padma Shri, and Padma Bhushan. Indian cricketer Mithali Raj is the test and ODI captain of the womens national squad. She is the first female cricketer in womens one-day international matches to have scored more than 7,000 runs. She has received several national and international honours, including the Padma Shri from the Indian government in 2015 and the Wisden Leading Woman Cricketer in the World in 2017. She is one of the most well-known female players in the world. The first Indian to win the world championship in badminton is PV Sindhu. Only two Indian athletes have ever won back-to-back medals in the Olympics, Sindhu being the other. Sindu has received the Arjuna Award, the Padma Shri, and the Rajiv Gandhi Khel Ratna Award. Women have battled their way out of the dominant society throughout the years. Since they never gave up, they have already attained their goal. Women have achieved success in their lives despite being marginalised thanks to their consistent perseverance and will to succeed. Women have made a significant presence in the sports business, and their persistence has paid off.",
        "words_count": 771,
        "datetime": "2024-04-27 21:39:01"
    },
    {
        "index": 10,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/legal-shack/the-regulation-of-fantasy-sports-in-india-53547/",
        "title": "The Regulation of Fantasy Sports in India",
        "content": "Fantasy sports or fantasy gaming has gained popularity in recent years and mainly after the covid-19 outbreak occurred in the year 2020. The industry of fantasy gaming has boomed since then as the number of users has been rising at a very rapid pace. Before analyzing the industry and the laws regulating it one needs to know what fantasy gaming and fantasy sports are all about. FANTASY SPORTS Fantasy sports or known as rotisserie sport is a form of online game that is virtually played through performances of athletes in real life. The participants in a fantasy sport act as managers as they draft, trade, and select their own lineup of professional athletes. The participants can either play in free competitions or can also pay and win as per the amount of the contest. It is mainly an online prediction game based entirely on real-life sports matches. The participants can play against one or more participants. As per data released in February 2022 by the Federation of Indian Fantasy Sports (FIFS) and Deloitte (Deloitte, 2022), India has a market size of over INR 34,000 crore in the fantasy gaming industry. Buoyed by strategic investments the industry caters to over 13 crore registered users said the report. The report further said that 85% of the revenue is brought in through cricket. Football stood second with a 6.32% share. As per the FIFS estimates, the fantasy sports industry is estimated to grow to INR 1,65,000 in the fiscal year 2025.Since the fantasy sports industry is on a boom and has seen rapid expansion over the past few years its regulation has also been difficult. Different states have different laws regarding these which create confusion among the masses regarding its regulation. GAMBLING & BETTINGOne of the main issues which arise about fantasy sports is whether they can be considered as an act of gambling or betting. A simple definition of betting is the act of staking a wagering sum or amount which can be in the form of cash or any asset on the assumption that an eventwill occur or not. As stated by the Supreme Court of India in the case of Dr. K. R. Lakshmanan v. State of Tamil Nadu & Anr.32i, Gambling in a nut-shell is the payment of a price for a chance to win a prize. Games may be of chance, or of skill, or of skill and chance combined. A game of chance is determined entirely or in part by lot or mere luck. In these games, the result is wholly uncertain and doubtful. A game of skill, on the other hand  although the element of chance necessarily cannot be entirely eliminated  is one in which success depends principally upon the superior knowledge, training, attention, experience, and adroitness of the player.The Public Gambling Act, 1867 was introduced before the introduction of the Constitution of India. It prohibited public gambling and the keeping of common gaming houses but made an exception for games of skill. But after the promulgation of the constitution, the issues pertaining to gambling and betting were stated under Entry 34 of the state list. It meant that from now on, only the state legislature can make laws regarding these issues. DEVELOPMENTS  Odisha banned all types of online gaming apps under the Odisha Prevention of Gambling Act, 1955. Similarly, Andhra Pradesh has also banned fantasy gaming apps such as Dream 11 through the Andhra Pradesh Gaming Act of 1974. In order to make online gaming illegal, the Telangana cabinet enacted an ordinance in 2017 that amended the 1974 Telangana Gaming Act.  Assamese citizens are also not permitted to use online fantasy sports platforms such as MPL and Dream 11 as they are banned in Assam.  In the year 2021, the Kerala High Court issued a notice to Virat Kohli and other celebrities for promoting online rummy games and other fantasy sports. GAME OF SKILL vs GAME OF CHANCE Games of skill are identified as a separate category from the games of chance as it is not totally dependent upon the certainty of an event. In a game of skill, the skill factor predominates over the luck factor which is the opposite in the case of a game of chance. It does not depend on sheer luck. It includes strategies, talent, skills, team formation, player selectionetc. Whereas in a game of chance, winning is totally dependent upon luck and does not include strategies, team selection, etc. It is comparatively easy than a game of skill.Fantasy sports are considered as a game of skill as it includes the formation of strategies and other skills such as knowledge about players which are not required in a game of chance. The Punjab and Haryana High Court in 2017, in the case of Shri Varun Gumber v. Union Territory of Chandigarh and Orsii held that fantasy sports predominantly include the skill factor hence they cannot be considered as a game of chance. The Rajasthan High Court and the Bombay High Court too have considered fantasy sports as a game of skill. REGULATION The Supreme Court in September 2022 rejected a special leave petition filed by Avinash Mehrotra challenging the legality of fantasy sports in India. Rejecting the PIL the Supreme Court stated that Fantasy sports such as Dream 11 are a game of skill and are protected under Article 19(1)(g) of the Indian Constitution. The Rajasthan High Court also recently in 2023 observed that online gaming is not betting or gambling and granted interim relief to an online gaming platform named Myteam 11.Fantasy gaming is not directly mentioned in The Indian Constitution but The Supreme Court has time and again held that it is part of Article 19(1)(g). The article reads as follows: to practise any profession, or to carry on any occupation, trade or business This article provides citizens the fundamental right to practice any profession or to carry on any occupation, trade, or business. However, activities such as gambling do not come under the scope of this article as stated by the Supreme Court in State of Bombay v. Chamarbaugwalaiii. Hence fantasy games not being an act of gambling or betting, will be covered under Article 19(1)(g) and shall be protected by the government. CONCLUSION As pronounced by various courts in various cases, the debate over fantasy sports being a game of skill or a game of chance is well settled. Hence wasting time over this will result in losing an opportunity by not focusing on the booming industry of Fantasy Sports.The fantasy gaming industry is creating and will create many opportunities which can be utilized for growth.The way forward from here is to create a particular law that deals with all the fantasy gaming apps and sports, which will ultimately result in a more efficient regulation of this industry.",
        "words_count": 1137,
        "datetime": "2024-04-27 21:39:14"
    },
    {
        "index": 11,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/entropy/indias-tryst-with-sports-54372/",
        "title": "Indias Tryst With Sports",
        "content": "As India frenzies in its biggest annual sporting extravaganza, the Indian Premier League, two parts of the broadcast on the live stream, in particular, caught my attention. Amidst all the drama of the tournament and the crores of views it generated in the nearly 8 weeks the superstars of the cricketing world put on a breathtaking display of sporting excellence, it was an advertisement featuring Yuvraj Singh and Harbhajan Singh that took the cake in pushing the agenda for sports in India. The advertisement featuring the aforementioned legends of Indian cricket acted in a campaign in which they would watch India take on teams in different, oft-ignored sports in this country. Cadburys #CheerForAllSports couldnt come at a better time for all of us, it sheds light on the sheer overpowering support for cricket at the cost of virtually every other sport. As the IPL reaches its climax and millions of sports fans in India go searching for something new to entertain themselves in the evenings and weekends that were spent watching cricket, the Cadbury ads message could prove to be the change that drives all sports to achieve some level of parity with Indias most popular sport. Yuvraj and Harbhajan celebrating Indias success on the screen might not in itself drive the masses to suddenly develop an interest in the multitude of sporting successes in the country but it certainly pokes and prods at peoples general ignorance of the lack of interest in them and how it translates to their growth and development. In this article, I delve into a few examples which make my point about these sportspersons not getting their deserved plaudits To start with a more positive situation with respect to general medias coverage and peoples interest, the recent protests against Indian wrestlings governing body and its upper management have been extensively in the news. While promising that other sports personalities are warranting a few headlines in mainstream media, it is worth questioning if it is because these medal-winning wrestlers are only in the news because of the nature of the news. The scandal behind a political partys leaders alleged actions might be pushing it more into the limelight than the identity of the victims. If the same were to happen in a completely irrelevant(w.r.t sports) governing body, per se, rural development, it might warrant almost as much attention. All this in the grand scheme of things makes for a very morbid reading. Sportsmen and women whose achievements are generally ignored unless they win Olympic medals for the country shouldnt be the normal state of affairs in the country. PV Sindhu might have won medals for India in the Olympics, but her fellow badminton player Kashyap Sen reached the finals of the All England Open, Prakash Padukone and Pullela Gopichand remain the only Indians to have won it, and if you were to ask most people they would blink and shrug at the achievement and put it out of their mind and his achievement would go unrecognized. Sunil Chettri is fifth in the list of most goals scored by a player for their national team in world football and he did this while playing for an Indian team which isnt anywhere near the pinnacle of the sport, yet it is only brought up to slight Lionel Messi for the brief time Chettri was ahead in the list. All this is to say, please wake up my fellow countrymen, if we want to celebrate more success in the Olympics, they deserve a lot more followers. More support and interest generate more revenue by way of sponsorships, stadium income and tv rights, which directly leads to more money circulating in the sport and better facilities and amenities for them. Indias quest for glory often starts when these sportspeople are still toddlers, not when theyre playing in the semi-finals or the finals of the Olympics. They need more from us in the years leading up to the Olympics than the one day they actually take part in it. Lets cheer them on for a few years and see where it takes us instead of the few days we tend to do it. Signing off, an avid sports fan and a hypocrite trying to live up to his own words.",
        "words_count": 709,
        "datetime": "2024-04-27 21:39:23"
    },
    {
        "index": 12,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/be-best/business-behind-ipl-52597/",
        "title": "Business Behind IPL!",
        "content": "Summer in India is all about the festival of cricket for two continuous months in India. Its IPL which is an interesting concept of combining top players with growing youngsters where the nation is never a barrier. Fans can witness their idols playing together in the same team. This can never happen in International Cricket. Since the first year of the tournament in 2008, The craze for IPL has hooked up year after year. The tournament is one of the costliest with its wide reach all over the world. Why is it so? Football is the major sport in the world. Most of its league has a greater market value around the world. However, IPL managed to become one. It is actually the only cricket tournament that is in the list of lucrative leagues with over 48,000 crores only on Media rights. Each match is valued at around 100 crores in value. How did this begin? Globalisation has created access to new cultures, technology and innovation and created a faster phase in our lifestyle. This impacted many sectors including sports. Cricket as a global sport has always changed its format to align with the world from being played for five long days to One Day International format for the convenience of the business and audience. Lastly, the T-20 format in past decades where the match ends maximum by 3 hours. This was more convenient to common people who spent time watching the match and also opened gates in the business aspect. It is short, crisp and highly entertaining like that of a cinema! There are plenty of T-20 leagues around the world like the T-20 Cup in England, the Big Bash League(BBL) and so on. However, IPL was the most successful compared to other leagues because of the freedom and involvement of franchise owners who pumped loads of money into the grounds of IPL which has brought more glamour and popularity to the league. They have space to make decisions in strategy and marketing that have brought new ideas to practise and made the league even more exciting. Since the teams are named among the top cities of the country, The teams have a fan following from the locale that is mad about their success. People get pumped with excitement for every match played by their team, especially children and youngsters! This resulted in the increase in the brand value of IPL to a whopping 6.8 Billion Dollars. The quality of cricket from the league with top players around the world keeps every match nail-biting and interesting. This is more than enough for a common cricket fan to go wild about the match. IPL is not all about cricket, It is about entertainment! Celebrity appearances, dance performances, vibrant musical environment, fantasy cricket and so on associated with the league make it the topic for youngsters to discuss about wherever they go. It is an easy word-of-mouth publicity for the league. In fact, The league remains the matter of headlines for two months in the country. It will be head-scratching for a common man to understand the sponsorship and the business involved in every game of the tournament. Almost everything you see in a match has some kind of sponsorship from bat to even every six that is hit out of the ground. However, The league remains a great stage for youngsters to perform and bring them to the limelight. This will happen when a youngster starving for a chance utilises and performs with his costly chance to showcase his talent. Keeping business aside, IPL remains the best stress buster for people working all along their life. It remains a topic to discuss and have fun with! Spending a Saturday night at the best restaurants and bars while watching the best cricket would be good for your life. Top-class listing sites like ThreeBestRated would be helpful to find one. Never forget to have entertainment as part of your life that eases you from your stress. This can keep you moving towards your goals in life with happiness and enjoyment.",
        "words_count": 678,
        "datetime": "2024-04-27 21:39:29"
    },
    {
        "index": 13,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/sashinct/the-coming-of-age-of-super-dads-and-super-moms-in-sports-50680/",
        "title": "The coming of age of super dads and super moms in sports",
        "content": "Tom Brady 44,the New England Patriots and Tampa Bay Buccaneers quarterback with six Super Bowl titlesretired very recently after a dream career which saw him as the oldest NFL Most Valuable Player at the age of 43, the only player ever to win three Super Bowls spread across three separate decades. Tiger Woods at 46,the15 time major golf champion and widely regarded as one of the best golfers and athletes of all time remains still an active pro- golfer after multiple life -threatening injuries. Roger Federer at 36, the tennis legend tied to both greatness and longevity was the first male tennis player to win 20 Grand Slam tennis tournaments only to be upstaged by both his fellow compatriots cum rivals Rafael Nadal 36 and Novak Djokovic 35 are tied at 22 Grand Slams each and still looking good for a couple of more seasons. JIMMY ANDERSON at 40, the English archimage of swing bowling who captured 600 wickets as the first ever fast bowler in the history of the game on 25 August 2020 still continues to be a force to reckon with in international cricket. Sachin Tendulkar, arguably the worlds greatest batsman played his 200th Test match at the age of FORTY and amassed a world record of 15,921 runs. Serena Williams quit when she was all of FORTY after winning a record number of 23 singles Grand Slam titles and a combined total of 39 Grand Slams (singles & doubles/mixed), the most in an Open Era by any tennis player. Lionel Messi, the dream merchant who famously lived upto his dream of winning the World Cup for the Les Albiceleste prior to his retirement was 35 years old at Qatar (November 2022) with a two- decade old international career already behind him. And only last week. LEBRON JAMES 38,the NBA professional and hoopster from Los Angeles Lakers connected a step back jumper to score a world record by taking his career total to a staggering 38,388 points in a two decade long journey to become the highest scorer in NBA professional history, eclipsing a record that had stood for close to four decades (courtesy Kareem Abdul Jabbar) . This record not only has class written all over it but exemplifies an athletes resounding skill, talent, speed, stamina and endurance combined with the fine art of balancing ones family life and a sporting career extraordinary. That Lebrons is a numero-uno sporting record can only be possibly guaged in terms of its unique achievement and magnitude with another unique record which even till date after 39 years still remains unbroken, when one unassuming 32  years old from then Czech Republic, Jarmila Kratochvilova last lap burst shattered the 800 metres world record with a world record winning time of 1min 53.28 secs at the Helsinki World Championships in 1983. That Jarmila also won the 400 metres with another world record time (later broken) is what transcends these athletes from mortal sportspersons to immortal dream merchants. Only, Oksana Chusovitina 47, an eponymous skilled gymnast who represented four former countries (now still representing Uzbekistan) has redefined her sport and has no peers in her sporting odyssey which spans EIGHT consecutive OLYMPICS. Closer home our very own Mithali Raj and Jhulan Goswami, Sania Mirza, an Anil Kumble have all had a dream run over their illustrious career of nearly two decades and called it a day on the wrong side of THIRTY after being champion players. Laender Paes, finally hung his racquet at the age of FORTY- SEVEN having won a record 18 Grand Slam titles in doubles and mixed doubles Needless to say, all of them have but one thing in common- the pure passion for the sport they played and which made them conquer dizzying heights of glory and fame in their respective professional career. They were and will remain the ultimate dream merchants of their respective sport. Their mantra  LONGEVITY FOR SUCCESS AND GREATNESS. Two decades in any sport at the highest- level calls for supreme physical fitness, mental endurance, motivation, balancing ones personal life with their passion and above all the support of fans, family& kids and own pro-team. Sportspersons are born to attain success or failure and successful athletes are those who last long to chase their goals unmindful of failures, super successful amongst them last longer till they realise their own dream(s) and to become part of sporting folklore. As sports lovers and fans, we could not have dreamt anything better as the age of super dads and super moms has well and truly arrived. ",
        "words_count": 763,
        "datetime": "2024-04-27 21:39:37"
    },
    {
        "index": 14,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/only-thoughts/virat-kholi-journey-between-70s-to-71s-century-50399/",
        "title": "Virat Kholi: Journey Between 70s to 71s Century",
        "content": "Virat Kohli, the Indian cricket teams former captain, has taken the cricket world by storm since his international debut in August 2008. In a short span of time, Kohli has established himself as one of the greatest batsmen of all time and has already amassed an impressive list of records and achievements. Kohlis rise to the top of the cricketing world was not an overnight success story. It was built on years of hard work, determination, and an unrelenting pursuit of excellence. Kohlis aggressive batting style and relentless work ethic have earned him widespread acclaim, and his popularity has only continued to grow with each passing year. In One Day Internationals (ODIs), Kohli has amassed 43 centuries, which is the most by any Indian player and the fifth-most by any player in the world. He has also scored 27 Test centuries, making him one of the few batsmen in the world to have more than 25 centuries in both formats of the game. Kohlis ability to score runs consistently and in high-pressure situations sets him apart from other batsmen. He has a remarkable average of 59.33 in ODIs and 53.25 in Test cricket, which is a testament to his longevity and ability to perform under pressure. Kohlis hunger for success and his never-say-die attitude has earned him the nickname Run Machine. He is a true leader on and off the field, inspiring his teammates with his determination and fierce competitiveness. His exceptional work ethic and passion for the game have made him a role model for young cricketers worldwide. Its important to remember that all athletes, regardless of their skill and success, go through ups and downs in their careers. No one is immune to poor form or struggles, and its not uncommon for even the greatest players to go through rough patches. In Kohlis case, its important to note that he is only human and has faced many challenges, both on and off the field. Its not fair to single him out and criticize him, especially when there are so many other factors at play, such as the impact of COVID-19 on the cricketing calendar and the pressure of performing in high-stakes tournaments like the IPL. Its also important to remember that the criticism he has faced is not representative of the larger cricketing community. Many fans, players, and analysts continue to admire and respect Kohli for his talent and contributions to the sport. As for the criticism towards Kohlis wife and daughter, it is unacceptable and should not be tolerated. Personal lives and family should be off-limits and not used to criticize an athletes performance. But the special thing about time is that it changes. In an Asia Cup 2022 Super Four encounter against Afghanistan in Dubai, Virat Kohli scored his first T20I century for India, breaking a 1019-day wait for his 71st international century. Throughout his innings, Kohli broke a lot of records. In place of Rohit Sharma, the Indian captain, Kohli started the innings. Ibrahim Zadran of Afghanistan dropped Kohli while he was on 28. With 276 runs in five innings, he has now scored the most runs in this Asia Cup. Prior to the competition, Kohli has played in just four T20Is this year, totaling 81 runs in just four innings. The 33-year-old had earlier achieved an international century on November 23, 2019, in Kolkata, during a pink-ball Test match against Bangladesh. ",
        "words_count": 567,
        "datetime": "2024-04-27 21:39:54"
    },
    {
        "index": 15,
        "label": "sports",
        "link": "https://timesofindia.indiatimes.com/readersblog/whisperings-of-the-heart/rock-paper-scissors-and-football-48419/",
        "title": "Rock, paper, scissors and football",
        "content": "It is midnight in the south Indian state of Kerala. My clock says half an hour past one. But the thunderous festivities from the lively streets outside my apartment suggest otherwise. I rubbed my eyes to confirm the time. Whats happening here?! Christmas Carol?! I mumble. My wife reminds me in a soft note, Messis Argentina won the world cup just a few hours back, dont you remember?! My eight year old son, who had drained every bit of his energy, cheering for and celebrating the ultimate victory of his sporting hero, sleeps peacefully beside me, clad in a white number 10 jersey with sky blue stripes. In a nation which is blindly in love with the so-called gentlemans game, no other sport has managed to assume a stature anywhere closer, not in the past four decades or so. But heres a small strip of land in the southern tip of the peninsula, where legions of football fans take to the streets on a cold December night to watch a South American team locking horns with the reigning champions from Europe for the crowning glory of the game. In this part of the world, cricket is a matter of national pride; but football is an emotion; a passion that runs deep in the veins. Pele or Maradona, Beckham or Figo, Zidane or Klose, Lewandowski or Suarez  no matter what the genealogy or nationality is, takers are aplenty in Gods own country for the heroes of the game. Fan-made effigies of Messi, Neymar and Ronaldo may stand close together and wink a smile at you, from the picturesque riverbanks and verdant valleys of Kerala villages. Players divided by continents are united in the walkways here by the unique passion for the game. This transcending penchant for the game in a tiny pocket of the cricket-crazy subcontinent was a revelation that surprised the world during the just concluded football fiesta. But that was not all.. From the kick-off round which jolted the eventual champions with an abrupt end to their 36-match undefeated streak; to the knock-outs which saw an African team leapfrogging its rivals to gatecrash the prediction charts for the semifinals; and to the final showdown which swayed back and forth until that destined moment of ceremonial crowning of Lionel Messi as the most accomplished player of all time  this tournament kept throwing up surprises at each stage, making it a true rollercoaster ride for the teams and the fans alike. As I were to realise later, the surprises were far from over!! The day after the grand finale, as I walked back home in the evening, expecting to see my little Messi having a roll with the ball on the grass, what awaited me was an inexplicably quiet playing area. To my astonishment, the boy was spotted indoors in the company of his friend, mesmerizingly bound to the palpable excitement of the finger game they were playing  Rock, paper, scissors. Is this the same boy who was kicking imaginary footballs in air last night, craving to emulate the heroics of the one whose name he was bearing on his jersey?! Was all that excitement meant to be too short-lived? Inspite of all the inspiration garnered for daily physical activity, are we back to square one?!! My heart sank.. Son, how do you master football by sitting in a corner and making gestures with your hands. Football is a physical sport- a game of agility, fitness and finesse. But Appa, one needs to practise this as well to win the world cup!!  he retorted dismissively, without taking eyes off his playmates hand. What?!- I was shell-shocked. You mean to say that they won the cup by sheer luck, and not skills? Rock paper scissors is not about luck, Appa. Its about mind-reading skills. Didnt you see who snatched the game in the end last night?!! I was flabbergasted. As I quietly sank into the sofa staring blankly at their hand game and reminiscing the final moments of the penalty shoot-out, the logic behind the eight-year-olds observation slowly dawned on my senescing wits. Despite Messis wizardry, despite De Marias brilliance, despite all the exuberance and exhilaration that lasted 120 minutes of scintillating soccer, as the evasive moment of glory refused to side up with either of the teams, it was the intuitive accuracy of one man, that cracked the impasse and sealed the history for Messis marauders  Emiliano Martinez, the man with the golden gloves. As my son stared at his playmates eyes in anticipation of making the next gesture, the towering image of a vibrant Martinez jouncing under the bar flashed before my eyes. On that historic night of fluctuating fortunes, as Emiliano Martinez geared up to face the penalty kicks, three out of his four dives were spot-on, as if he was reading the strikers mind. Even Kylian Mbappe would have let out a huge sigh of relief, as his high octane strike jostled past the clairvoyant goalkeepers left hand into the nets. Rock, paper or scissors  Right, left or centre! In the run-up to the world cup, could Martinez have been mastering the meditative art of guessing the rocks, papers, and scissors with his masterly hands day in and day out, as the little one seemed to suggest?! Well, whether he was or not, as little Messi rightly pointed out, mind games win football matches too!! I withdrew quietly from the scene with a smile of enlightenment, as their little hands geared up for the next penalty kick!! ",
        "words_count": 925,
        "datetime": "2024-04-27 21:40:09"
    }
]